app/Http/Controllers/Auth/LoginController.php

    public function login(Request $request)
    {
        $credentials = $request->only('email', 'password');

        $users = User::where('email', $request->email)->get(['id', 'email', 'password', 'role_id', 'school_id']);
---
select `id`, `email`, `password`, `role_id`, `school_id` from `users` where `email` = 'a@b.com'

        $school = app('school');
        $request->merge(['school_id' => $school->id]);
        $logged_in = false;
        $gs = SmGeneralSettings::where('school_id', $school->id)->first();
---
select * from `sm_general_settings` where `school_id` = 1 limit 1

            //     return $this->sendLockoutResponse($request);
            // }

            $user = User::where('username', $request->email)->where('school_id', $school->id)->first();

            if (! $user) {
                $user = User::where('phone_number', $request->email)->where('school_id', $school->id)->first();
            }

            if (! $user) {
                $user = User::where('email', $request->email)->where('school_id', $school->id)->first();
---
select * from `users` where `username` = 'a@b.com' and `school_id` = 1 limit 1
select * from `users` where `phone_number` = 'a@b.com' and `school_id` = 1 limit 1
select * from `users` where `email` = 'a@b.com' and `school_id` = 1 limit 1

            $date_format_id = generalSetting()->date_format_id;
            $system_date_format = 'jS M, Y';
            if ($date_format_id) {
                $system_date_format = SmDateFormat::where('id', $date_format_id)->first(['format'])->format;
---
select `format` from `sm_date_formats` where `id` = 1 limit 1

            // System academic session id in session

            $all_modules = [];
            $modules = InfixModuleManager::select('name')->get();
---
select `name` from `infix_module_managers`

            $ttl_rtl = generalSetting()->ttl_rtl;
            session()->put('text_direction', $ttl_rtl);

            $active_style = SmStyle::where('school_id', Auth::user()->school_id)->where('is_active', 1)->first();
            session()->put('active_style', $active_style);

            $all_styles = SmStyle::where('school_id', Auth::user()->school_id)->get();
---
select * from `sm_styles` where `school_id` = 1 and `is_active` = 1 limit 1
select * from `sm_styles` where `school_id` = 1

            if (moduleStatusCheck('University')) {
                $academic_years = Auth::check() ? UnAcademicYear::where('active_status', 1)->where('school_id', Auth::user()->school_id)->get() : '';
            } else {
                $academic_years = Auth::check() ? SmAcademicYear::where('active_status', 1)->where('school_id', Auth::user()->school_id)->get() : '';
---
select * from `sm_academic_years` where `active_status` = 1 and `school_id` = 1 and `sm_academic_years`.`active_status` = 1 and `sm_academic_years`.`school_id` = 1

                if (! $session_id) {
                    $session = SmAcademicYear::where('school_id', Auth::user()->school_id)->where('active_status', 1)->first();
                } else {
                    $session = SmAcademicYear::find($session_id);
---
select * from `sm_academic_years` where `sm_academic_years`.`id` = 1 and `sm_academic_years`.`active_status` = 1 and `sm_academic_years`.`school_id` = 1 limit 1


            session()->put('school_config', generalSetting());

            $dashboard_background = DB::table('sm_background_settings')->where([['is_default', 1], ['title', 'Dashboard Background']])->first();
            session()->put('dashboard_background', $dashboard_background);

            $email_template = SmsTemplate::where('school_id', Auth::user()->school_id)->first();
---
select * from `sm_background_settings` where (`is_default` = 1 and `title` = 'Dashboard Background') limit 1
select * from `sms_templates` where `school_id` = 1 limit 1

            }

            $smUserLog->user_agent = $agent->browser().', '.$agent->platform();
            $smUserLog->save();
---
insert into `sm_user_logs` (`user_id`, `role_id`, `school_id`, `ip_address`, `academic_id`, `user_agent`, `updated_at`, `created_at`) values (1, 1, 1, '127.0.0.1', 1, 'Chrome, Linux', '2026-03-27 13:49:25', '2026-03-27 13:49:25')

    public function loginFormTwo()
    {
        $school = app('school');
        $data = [];

        $login_background = SmBackgroundSetting::where('school_id', $school->id)->where([['is_default', 1], ['title', 'Login Background']])->first();

        if (empty($login_background)) {
            $data['css'] = "background: url('../../../CC.png') no-repeat center; background-size: cover;";
        } elseif (! empty($login_background->image)) {
            $data['css'] = "background: url('".url($login_background->image)."')  no-repeat center;  background-size: cover;";
        } else {
            $data['css'] = 'background:'.$login_background->color;
        }

        if (config('app.app_sync')) {
            $roles = [1];
            if (! moduleStatusCheck('Saas') || session('domain')) {
                $roles = [1, 2, 3, 4, 5, 6, 7, 8];
            }

            // $data['users'] = User::whereIn('role_id', $roles)->select('role_id', 'email')->where('school_id', $school->id)->orderByRaw('FIELD(role_id, 1, 5, 4, 3, 6, 7, 8, 2)')->get()->groupBy('role_id');
            $data['users'] = User::whereIn('role_id', $roles)->where('school_id', $school->id)->select('role_id', 'email')->orderBy('role_id')->orderBy('id', 'asc')->get()->groupBy('role_id')->map(fn ($users) => $users->first())->filter();

            if (moduleStatusCheck('Saas')) {
                $data['schools'] = SmSchool::orderBy('school_name', 'asc')->take(5)->get()->except($school->id);
            }
        }
        $data['system_setting'] = SmGeneralSettings::where('school_id',$school->id)->first();
---
select * from `sm_background_settings` where `school_id` = 1 and (`is_default` = 1 and `title` = 'Login Background') limit 1
select * from `sm_general_settings` where `school_id` = 1 limit 1