app/Http/Controllers/Parent/SmParentPanelController.php

    public function parentDashboard(Request $request)
    {
        \Log::info('Parent dashboard controller called for user: ' . auth()->user()->id);
            $holidays = SmHoliday::where('active_status', 1)->where('academic_id', getAcademicId())->where('school_id', auth()->user()->school_id)->get();
            $my_childrens = auth()->user()->parent ? auth()->user()->parent->childrens->load('assignSubjects', 'assignSubject', 'studentOnlineExams', 'studentRecords', 'studentRecords.feesInvoice', 'studentRecords.class', 'studentRecords.section', 'studentRecords.incidents', 'examSchedule', 'attendances') : [];

            $sm_weekends = SmWeekend::orderBy('order', 'ASC')->where('active_status', 1)->where('school_id', auth()->user()->school_id)->get();
            $smevents = SmEvent::where('active_status', 1)
                ->where('academic_id', getAcademicId())
                ->where('school_id', auth()->user()->school_id)
                ->where(function ($q): void {
                    $q->where('for_whom', 'All')->orWhere('for_whom', 'Parents');
                })
                ->get();
---
select * from `sm_holidays` where `active_status` = 1 and `academic_id` = 1 and `school_id` = 1 and `sm_holidays`.`academic_id` = 1 and `sm_holidays`.`school_id` = 1
select * from `sm_classes` where `sm_classes`.`id` in (1)
select * from `sm_sections` where `sm_sections`.`id` in (1)
select * from `sm_weekends` where `active_status` = 1 and `school_id` = 1 and `sm_weekends`.`school_id` = 1 order by `order` asc
select * from `sm_events` where `active_status` = 1 and `academic_id` = 1 and `school_id` = 1 and (`for_whom` = 'All' or `for_whom` = 'Parents') and `sm_events`.`active_status` = 1 and `sm_events`.`academic_id` = 1 and `sm_events`.`school_id` = 1

                $count_event++;
            }

            $totalNotices = SmNoticeBoard::where('active_status', 1)->where('inform_to', 'LIKE', '%3%')
                ->orderBy('id', 'DESC')
                ->where('publish_on', '<=', date('Y-m-d'))
                ->where('academic_id', getAcademicId())
                ->where('school_id', auth()->user()->school_id)->get();
            $currency = SmGeneralSettings::find(1);
---
select * from `sm_notice_boards` where `active_status` = 1 and `inform_to` LIKE '%3%' and `publish_on` <= '2026-03-27' and `academic_id` = 1 and `school_id` = 1 and `sm_notice_boards`.`active_status` = 1 and `sm_notice_boards`.`academic_id` = 1 and `sm_notice_boards`.`school_id` = 1 order by `id` desc
select * from `sm_general_settings` where `sm_general_settings`.`id` = 1 limit 1

            $complaints = SmComplaint::with('complaintType', 'complaintSource')->get();

            $data['settings'] = SmCalendarSetting::get();
            $data['roles'] = InfixRole::where('is_saas', 0)->where(function ($q): void {
                $q->where('school_id', auth()->user()->school_id)->orWhere('type', 'System');
            })
                ->whereNotIn('id', [1, 2])
                ->get();
            $smAcademicCalendarController = new SmAcademicCalendarController();
            $data['events'] = $smAcademicCalendarController->calenderData();

            // Get latest pending items assigned to this parent, then split by assignment type.
            $assigned_items = ParentRecommendedItem::where('parent_id', auth()->id())
                ->where('status', 'pending')
                ->with(['recommendedItem', 'batch'])
                ->orderByDesc('created_at')
                ->take(18)
                ->get();
---
select * from `infix_roles` where `is_saas` = 0 and (`school_id` = 1 or `type` = 'System') and `id` not in (1, 2)
select * from `parent_recommended_items` where `parent_id` = 5 and `status` = 'pending' and `parent_recommended_items`.`deleted_at` is null order by `created_at` desc limit 18
select * from `school_recommended_items` where `school_recommended_items`.`id` in (3, 4, 5, 6) and `school_recommended_items`.`deleted_at` is null

    public function recommendedItemsCart()
    {
        try {
            $parent = auth()->user();
            $cart_items = ParentRecommendedItem::where('parent_id', $parent->id)
                ->where('status', 'pending')
                ->with('recommendedItem', 'student')
                ->paginate(10);

            $currency = SmGeneralSettings::find(1);
            $total_amount = ParentRecommendedItem::where('parent_id', $parent->id)
                ->where('status', 'pending')
                ->with('recommendedItem')
                ->get()
                ->sum(function($item) {
                    $qty = (int) ($item->assigned_quantity ?: 1);
                    return $item->recommendedItem ? ((float) $item->recommendedItem->price * $qty) : 0;
                });

            return view('backEnd.parentPanel.recommended_items_cart', compact('cart_items', 'currency', 'total_amount'));
        } catch (Exception $exception) {
            Log::error($exception->getMessage());
            return back()->with('error', 'Failed to load cart');
---
select * from `parent_recommended_items` where `parent_id` = 5 and `status` = 'pending' and `parent_recommended_items`.`deleted_at` is null limit 10 offset 0
select * from `school_recommended_items` where `school_recommended_items`.`id` in (3) and `school_recommended_items`.`deleted_at` is null
select count(*) as aggregate from `parent_recommended_items` where `parent_id` = 5 and `status` = 'pending' and `parent_recommended_items`.`deleted_at` is null
select * from `sm_general_settings` where `sm_general_settings`.`id` = 1 limit 1
select count(*) as aggregate from `parent_recommended_items` where `parent_id` in (5, 2) and `status` = 'pending' and `parent_recommended_items`.`deleted_at` is null
select * from `parent_recommended_items` where `parent_id` = 5 and `status` = 'pending' and `parent_recommended_items`.`deleted_at` is null
select * from `parent_recommended_items` where `parent_id` in (5, 2) and `status` = 'pending' and `parent_recommended_items`.`deleted_at` is null

    public function checkoutRecommendedItems(Request $request)
    {
        $request->validate([
            'item_ids' => 'required|array',
            'item_ids.*' => 'integer',
        ]);

        $parent = auth()->user();

        $items = ParentRecommendedItem::where('parent_id', $parent->id)
            ->whereIn('id', $request->input('item_ids', []))
            ->where('status', 'pending')
            ->with('recommendedItem')
            ->get();
---
select * from `school_recommended_items` where `school_recommended_items`.`id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22) and `school_recommended_items`.`deleted_at` is null