app/Http/Controllers/Parent/SmParentPanelController.php

    public function recommendedItemsCart()
    {
        try {
            $parent = auth()->user();
            $context = $this->parentContext();
            $cart_items = $this->parentAssignedItemsQuery($context)
                ->where('status', 'pending')
                ->with('recommendedItem', 'student')
                ->paginate(10);

            $currency = SmGeneralSettings::find(1);
---
select * from `sm_general_settings` where `sm_general_settings`.`id` = 1 limit 1

    public function recommendedItemsCheckoutPage()
    {
        $itemIds = (array) session()->get('recommended_items_checkout_item_ids', []);
        $itemIds = array_values(array_filter($itemIds));

        if (empty($itemIds)) {
            Toastr::warning('Please select items to checkout first.', 'Warning');
            return redirect()->route('parent-recommended-items-cart');
        }

        $context = $this->parentContext();

        $items = $this->parentAssignedItemsQuery($context)
            ->whereIn('id', $itemIds)
            ->where('status', 'pending')
            ->with('recommendedItem', 'student')
            ->get();
---
select * from `school_recommended_items` where `school_recommended_items`.`id` in (10, 11) and `school_recommended_items`.`deleted_at` is null

            return $price * $qty;
        });

        $currency = SmGeneralSettings::find(1);
---
select * from `sm_general_settings` where `sm_general_settings`.`id` = 1 limit 1