app/Http/Controllers/Admin/StudentInfo/AssignItemsToStudentController.php

    public function index()
    {
        $schoolId = auth()->user()->school_id;
        $classes = SmClass::where('school_id', $schoolId)->orderBy('class_name')->get();

        $batches = ItemAssignmentBatch::with(['items.recommendedItem'])
            ->where('school_id', $schoolId)
            ->orderByDesc('id')
            ->paginate(10);
---
select * from `item_assignment_batches` where `school_id` = 1 order by `id` desc limit 10 offset 0
select * from `parent_recommended_items` where `parent_recommended_items`.`assignment_batch_id` in (1, 2, 3, 4, 5, 6, 7, 8) and `parent_recommended_items`.`deleted_at` is null
select * from `school_recommended_items` where `school_recommended_items`.`id` in (2, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16) and `school_recommended_items`.`deleted_at` is null
select count(*) as aggregate from `item_assignment_batches` where `school_id` = 1