app/Helpers/Helper.php

    function moduleStatusCheck(string $module)
    {
        try {
            $all_module = session()->get('all_module');
            $moduleStatus = true;

            if (empty($all_module)) {
                $all_module = [];
                $modules = InfixModuleManager::select('name')->get();
---
select `name` from `infix_module_managers`

    function getUserLanguage()
    {

        if (Auth::check()) {
            return userLanguage();
        }

        $school_id = app()->bound('school') ? app('school')->id : 1;
        $user = User::where('role_id', 1)->where('school_id', $school_id)->first();
---
select * from `users` where `role_id` = 1 and `school_id` = 1 limit 1

    function generalSetting()
    {
        if (session()->has('generalSetting')) {
            return session()->get('generalSetting');
        }

        if (app()->bound('school')) {
            $generalSetting = SmGeneralSettings::where('school_id', app('school')->id)->first();
---
select * from `sm_general_settings` where `school_id` = 1 limit 1

    function userRtlLtl()
    {
        // return 1;

        if (session()->has('user_text_direction')) {
            return session()->get('user_text_direction');
        }

        $school_id = app()->bound('school') ? app('school')->id : 1;
        $user = User::where('role_id', 1)->where('school_id', $school_id)->first();
---
select * from `users` where `role_id` = 1 and `school_id` = 1 limit 1

        }

        if (! $school) {
            $school = Auth::check() ? auth()->user()->school : SmSchool::where('id', 1)->first();
---
select * from `sm_schools` where `id` = 1 limit 1

    function getSubjectAttendance($record)
    {
        return SmSubjectAttendance::with('student')
            ->whereIn('academic_id', $record->pluck('academic_id'))
            ->whereIn('student_record_id', $record->pluck('id'))
            ->whereIn('school_id', $record->pluck('school_id'))
            ->get();
---
select * from `sm_subject_attendances` where `academic_id` in (1) and `student_record_id` in (1) and `school_id` in (1)