app/Http/Controllers/LandingController.php

    public function index()
    {
        try {
            $schoolId = $this->resolveSchoolId();
            $homePage = SmHomePageSetting::where('school_id', $schoolId)->first();
            $news = SmNews::where('school_id', $schoolId)->where('mark_as_archive', 0)->orderBy('order', 'asc')->limit(3)->get();
            $courses = SmCourse::where('school_id', $schoolId)->orderBy('id', 'asc')->limit(3)->get();
            $events = SmEvent::where('school_id', $schoolId)->orderBy('from_date', 'desc')->limit(4)->get();
            $testimonial = SmTestimonial::where('school_id', $schoolId)->get();
            $contact_info = SmContactPage::where('school_id', $schoolId)->first();
            $about = SmAboutPage::where('school_id', $schoolId)->first();
            $totalStudents = SmStudent::where('active_status', 1)->where('school_id', $schoolId)->count();
            $totalTeachers = SmStaff::where('active_status', 1)
                ->where(function ($q): void {
                    $q->where('role_id', 4)->orWhere('previous_role_id', 4);
                })
                ->where('school_id', $schoolId)
                ->count();
            $courseCount = SmCourse::where('school_id', $schoolId)->count();
            $notice_board = SmNoticeBoard::where('publish_on', '<=', date('Y-m-d'))
                ->where('school_id', $schoolId)
                ->where('is_published', 1)
                ->orderBy('created_at', 'DESC')
                ->take(3)
                ->get();
---
select * from `sm_home_page_settings` where `school_id` = 1 limit 1
select * from `sm_news` where `school_id` = 1 and `mark_as_archive` = 0 order by `order` asc limit 3
select * from `sm_courses` where `school_id` = 1 order by `id` asc limit 3
select * from `sm_testimonials` where `school_id` = 1
select * from `sm_contact_pages` where `school_id` = 1 limit 1
select count(*) as aggregate from `sm_students` where `active_status` = 1 and `school_id` = 1 and `sm_students`.`school_id` = 1
select count(*) as aggregate from `sm_staffs` where `active_status` = 1 and (`role_id` = 4 or `previous_role_id` = 4) and `school_id` = 1 and `sm_staffs`.`active_status` = 1 and `sm_staffs`.`school_id` = 1
select count(*) as aggregate from `sm_courses` where `school_id` = 1
select * from `sm_notice_boards` where `publish_on` <= '2026-03-25' and `school_id` = 1 and `is_published` = 1 and `sm_notice_boards`.`active_status` = 1 order by `created_at` desc limit 3