app/Providers/AppServiceProvider.php

    public function boot(): ?bool
    {

        if (class_exists(\Livewire\Livewire::class)) {
            \Livewire\Livewire::setUpdateRoute(function ($handle) {
                return Route::post('/custom/livewire/update', $handle);
            });
        }

        try {
            Paginator::useBootstrapFour();
            Builder::defaultStringLength(191);

            view()->composer('backEnd.partials.parents_sidebar', function ($view): void {
                $data = [
                    'childrens' => SmParent::myChildrens(),
                ];
                $view->with($data);

            });

            view()->composer('backEnd.partials.menu', function ($view): void {
                $notifications = DB::table('notifications')->where('notifiable_id', auth()->id())
                    ->where('read_at', null)
                    ->get();
---
select * from `notifications` where `notifiable_id` = 5 and `read_at` is null

                $view->with($data);
            });

            view()->composer(['backEnd.partials.menu', 'layouts.pb-site', 'frontEnd.home.front_master'], function ($view): void {
                $pluginCheck = Plugin::whereIn('name', ['tawk', 'messenger'])->where('school_id', app('school')->id)->get();
                $tawk = $pluginCheck->where('name', 'tawk')->first();
                $messenger = $pluginCheck->where('name', 'messenger')->first();
                $data = [
                    'tawk' => $tawk,
                    'messenger' => $messenger,
                    'position' => $tawk ? $tawk->position : null,
                    'messenger_position' => $messenger ? $messenger->position : null,
                ];
                $view->with($data);
            });
---
select * from `plugins` where `name` in ('tawk', 'messenger') and `school_id` = 1